configuration/src/Reports/RolesRights/RolesRights.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>RolesRights</name>
</mdclass:Report>

configuration/src/Catalogs/AccessGroupProfiles/AccessGroupProfiles.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>AccessGroupProfiles</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Administrator</name>
      <description>Administrator</description>
    </items>
  </predefined>
  <attributes>
    <name>SuppliedDataID</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>SuppliedProfileChanged</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Roles</name>
    <attributes>
      <name>Role</name>
      <type>
        <types>CatalogRef.ExtensionObjectIDs</types>
        <types>CatalogRef.MetadataObjectIDs</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AccessKinds</name>
    <attributes>
      <name>AccessKind</name>
      <comment>Represented by an empty reference of the main value type</comment>
      <type>
        <types>DefinedType.AccessValue</types>
      </type>
    </attributes>
    <attributes>
      <name>Predefined</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>AllAllowed</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AccessValues</name>
    <attributes>
      <name>AccessKind</name>
      <comment>Represented by an empty reference of the main value type</comment>
      <type>
        <types>DefinedType.AccessValue</types>
      </type>
    </attributes>
    <attributes>
      <name>AccessValue</name>
      <type>
        <types>DefinedType.AccessValue</types>
      </type>
    </attributes>
    <attributes>
      <name>IncludeSubordinateAccessValues</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Purpose</name>
    <attributes>
      <name>UsersType</name>
      <type>
        <types>DefinedType.User</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/Reports/RolesRights/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Public

#Region ForCallsFromOtherSubsystems

// See ReportsOptionsOverridable.BeforeAddReportCommands.
Procedure BeforeAddReportCommands(ReportsCommands, Parameters, StandardProcessing) Export
	
	If Not Common.SubsystemExists("StandardSubsystems.ReportsOptions") Then
		Return;
	EndIf;
	
	If Not AccessRight("View", Metadata.Reports.RolesRights)
	 Or StandardSubsystemsServer.IsBaseConfigurationVersion() Then
		Return;
	EndIf;
	
	CommandRoles = ReportsCommands.Add();
	CommandRoles.MultipleChoice = True;
	CommandRoles.Manager = "Report.RolesRights";
	CommandRoles.VariantKey = "RolesRights";
	
	If StrStartsWith(Parameters.FormName, "Catalog.AccessGroupProfiles") Then
		CommandProfiles = ReportsCommands.Add();
		CommandProfiles.MultipleChoice = True;
		CommandProfiles.Manager = "Report.RolesRights";
		CommandProfiles.VariantKey = "RightsRolesOnMetadataObjects";
		
		If Parameters.FormName = "Catalog.AccessGroupProfiles.Form.ItemForm" Then
			CommandRoles.Presentation    = NStr("en = 'Rights of profile roles';");
			CommandProfiles.Presentation = NStr("en = 'Rights of profile';");
		Else
			CommandRoles.Presentation    = NStr("en = 'Rights of profiles roles';");
			CommandProfiles.Presentation = NStr("en = 'Rights of profiles';");
		EndIf;
	Else
		CommandRoles.Presentation = NStr("en = 'Rights of profiles and roles';");
		CommandRoles.OnlyInAllActions = True;
		CommandRoles.Importance = "SeeAlso";
		CommandRoles.VariantKey = "RightsRolesOnMetadataObject";
	EndIf;
	
EndProcedure

// Parameters:
//   Settings - See ReportsOptionsOverridable.CustomizeReportsOptions.Settings.
//   ReportSettings - See ReportsOptions.DescriptionOfReport.
//
Procedure CustomizeReportOptions(Settings, ReportSettings) Export
	
	If Common.SubsystemExists("StandardSubsystems.ReportsOptions") Then
		ModuleReportsOptions = Common.CommonModule("ReportsOptions");
	Else
		Return;
	EndIf;
	
	ModuleReportsOptions.SetOutputModeInReportPanels(Settings, ReportSettings, False);
	ReportSettings.DefineFormSettings = True;
	
	OptionSettings = ModuleReportsOptions.OptionDetails(Settings, ReportSettings, "RolesRights");
	OptionSettings.LongDesc = NStr("en = 'Shows role rights that apply to metadata objects.';");
	OptionSettings.DefaultVisibility = False;
	
	OptionSettings = ModuleReportsOptions.OptionDetails(Settings, ReportSettings, "RightsRolesOnMetadataObjects");
	OptionSettings.LongDesc = NStr("en = 'Shows rights of one role to different metadata objects.';");
	OptionSettings.Enabled = False;
	
	OptionSettings = ModuleReportsOptions.OptionDetails(Settings, ReportSettings, "RightsRolesOnMetadataObject");
	OptionSettings.LongDesc = NStr("en = 'Shows rights of different roles to the same metadata object.';");
	OptionSettings.Enabled = False;
	
	OptionSettings = ModuleReportsOptions.OptionDetails(Settings, ReportSettings, "DetailedPermissionsRolesOnMetadataObject");
	OptionSettings.LongDesc = NStr("en = 'Shows detailed rights of one role to one metadata object.';");
	OptionSettings.Enabled = False;
	
EndProcedure

#EndRegion

#EndRegion

#EndIf
